<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $permissions = [
            'إدارة الأطباء',
            'قائمة الأطباء',
            'إدارة الأقسام',
            'قائمة الأقسام',
            'إدارة العنابر',
            'قائمة العنابر',
            'إدارة المستخدمين',
            'قائمة المستخدمين',
            'صلاحيات المستخدمين',
            'الإستقبال',
            'بيانات المريض الأوليه',
            'إدارة المرضى',
            'قائمة المرضى',
            'بيانات المريض النهائيه',
            'العمليات و التنويم',
            'قائمة العمليات',
            'إرشيف العمليات',
            'قائمة التنويم',
            'الفحوصات',
            'قائمة الفحوصات',
            'المتابعه',
            'قائمة المتابعه',
            'إدارة السجل الطبي و التقارير',
            'السجلات الطبيه',
            'التقارير',
            'أورنيك 3',
            'الجراحه و التدخلات الطبيه',
            'الأمراض الساريه و الغير ساريه',
            'المواليد و الوفيات',
            'إدارة المواليد و الوفيات',
            'وثيقة إخبار ولادة',
            'وثيقة إخبار وفاة',
            'إرشيف المواليد و الوفيات',
            'إرشيف المواليد',
            'إرشيف الوفيات',
        ];
        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }
    }
}
